---
kind: property
id: P:Autodesk.Revit.DB.Wall.Width
zh: 宽度
source: html/b8ebbd5d-b4ec-e98d-f16c-edcca14f921d.htm
---
# Autodesk.Revit.DB.Wall.Width Property

**中文**: 宽度

Get the overall thickness of the wall.

## Syntax (C#)
```csharp
public double Width { get; }
```